# По заданному числу n от 1 до 365 определите, на какое число какого месяца
# приходится день невисокосного года с номером n.
# Программа должна вывести два числа: число месяца (от 1 до 31)
# и номер месяца (от 1 до 12), соответствующие  дню  с номером n.

n = int(input("Введите целое числов от 1 до 365 включительно:\n"))

Calendar = {1: 31, 2: 28, 3: 31, 4: 30, 5: 31, 6: 30, 7: 31, 8: 31, 9: 30, 10: 31, 11: 30, 12: 31}

total = 0

for i in range(1, 13):
    pr = total
    month = i
    day = n - pr
    total += Calendar[i]
    if total >= n:
        break

print("Day:", day, "Month:", month)
