# Выборы. В одном государстве произошла реформа избирательной системы.
# С момента ее введения все избиратели государства делятся на K,
# возможно не равных по объему, групп. Внутри каждой группы проходит
# голосования "за" или "против". Если больше половины группы
# проголосовала "за", то общий голос группы считался "за", иначе - "против".
# Любой вопрос решался положительно, если больше половины групп проголосовало "за".
# Все бы ничего, но в такой системе есть недостаток.
# Партия, устроившая такую систему, получила возможность
# решать вопросы в свою пользу. Для этого они поместили в группы
# своих стронников. Например, для групп численностью 5, 5 и 7 человек
# достаточно иметь по три своих человека в первых двух группах.
# Всего 6 человек смогут решить вопрос в пользу партии.
# От Вас потребуется посчитать, какое минимальное количество сторонников
# надо иметь партии для заданного разбиения на группы.
# Формат входных данных
# На первой строке дано натуральное число K ≤ 10000.
# На следующей строке вводится K натуральных чисел через пробел.
# Формат выходных данных
# Одно число — минимальное количество сторонников партии.

K = int(input())  # Количество групп
groups = [int(s) for s in input().split()]  # Список численности групп

groups.sort()  # Сортируем список по возрастанию

number_of_groups = K // 2 + 1  # Кол-во групп для внедрения сторонников.

count = 0  # Количество сторонников

for i in range(number_of_groups):
    count += groups[i] // 2 + 1

print(count)
