# Напротив Васиного дома поставили забор, состоящий из 10 ** 9 дощечек.
# Каждый день, выгдядывая в окно, он видел, что часть забора
# с дощечки l i до дощечки r i красят в цвет c i . При этом он записывал,
# какой отрезок забора в какой цвет красили. Эти данные он предоставил Вам
# и просил ответить на вопрос: в какой цвет будут выкрашены интересующие Васю
# дощечки через N дней? Изначально все дощечки были цвета 0.
# На первой строке вводится число 0 <= N <= 100 - количество дней.
# Далее на 3*N строках идут тройки чисел (каждое в новой строке):
# 1 <= l i <= r i <= 10 ** 9 и 0 <= c i <= 10 ** 6
# Далее идет число 0 < M <= 100 - число интересующих Васю дощечек.
# Далее на M строках номера дощечек.
# Вывести M чисел, разделенных пробелами - цвета дощечек.

# Примеры
# Ввод
# 3
# 4
# 6
# 2
# 7
# 19
# 6
# 13
# 15
# 1
# 2
# 5
# 14
# Вывод
# 2 1

fence = []

days = int(input())

for i in range(days):
    l = int(input())
    r = int(input())
    c = int(input())
    fence.append((l, r, c))  # Храним в списке только тройки входных значений.

numbers = int(input())

planks = []

for i in range(numbers):
    planks.append(int(input()))

N = len(fence)

for item in planks:
    c = 0
    for i in range(-1, -N - 1, -1):  # Перебираем забор с конца к началу.
        if fence[i][0] <= item <= fence[i][1]:  # При нахождении первого совпадения
            print(fence[i][2], end=' ')  # выводим значение цвета и прерываем цикл перебора забора.
            c += 1
            break
    if c == 0:  # Если мы перебрали весь забор и не встретили ни одного совпадения,
        print(0, end=' ')  # выводим 0, т.к. эту доску не красили.
