# Найти первый не повторяющийся символ в строке.

from collections import defaultdict

line = input()  # Считываем строку.

letters = defaultdict(int)  # Создаем словарь для подсчета количества символов.

for letter in line:  # Перебираем символы в строке
    letters[letter] += 1  # и вносим их в словарь / обновляем количество.

result = None  # До начала цикла присвоиваем результирующей переменной значение None.
# Если в строке нет не повторяющихся символов, результат будет None.

for key, value in letters.items():  # Перебираем пары ключей и значений словаря.
    if value == 1:  # Если значение равно 1,
        result = key  # присваиваем переменной 'result' значение ключа
        break  # и прерываем цикл.

print(result)  # Выводим результат.
