# Найти первый повторяющийся символ в строке.

line = input()  # Считываем строку.

letters = set()  # Создаем множество для проверки повторяющихся букв.

result = None  # До начала цикла присвоиваем результирующей переменной значение None.
# Если в строке нет повторяющихся символов, результат будет None.

for letter in line:  # Перебираем символы в строке.
    if letter in letters:  # Если очередная буква уже есть в множестве,
        result = letter  # присваиваем переменной 'result' это значение
        break  # и прерываем цикл.
    else:  # Если в множестве нет такого символа,
        letters.add(letter)  # добавляем его.

print(result)  # Выводим результат.
