# По заданной квадратной матрице n×n из нулей и единиц определите,
# может ли данная матрица быть матрицей смежности простого
# неориентированного графа.
# На вход программы поступает число n ( 1 <= n <= 100) –
# размер матрицы, а затем n строк по n чисел,
# каждое из которых равно 0 или 1, – сама матрица.
# Формат выходных данных
# Выведите «YES», если приведенная матрица может быть
# матрицей смежности простого неориентированного графа,
# и «NO» в противном случае.

N = int(input())  # Количество вершин в графе

Graph = [0] * N  # Заготовка под матрицу смежности

for i in range(N):  # Считываем строки в матрицу смежности
    row = [int(s) for s in input().split()]
    Graph[i] = row

for i in range(N):
    if Graph[i][i] != 0:  # Проверяем, что главная диагональ заполнена нулями
        print("NO")
        exit()
    for j in range(N):  # Проверяем симметричность по главной диагонали
        if Graph[i][j] != Graph[j][i]:
            print("NO")
            exit()

print("YES")
