# Даны координаты (x, y) расположения двух прямоугольников на плоскости.
# Для каждого из прямоугольников известны координаты двух точек,
# задающие левый нижний и правый верхний углы.
# Найти площадь пересечения двух прямоугольников.

# Будем называть первый прямоугольник А, второй - В.
# Соответственно, обозначим точки, задающие расположение первого прямоугольника,
# Ax1, Ay1 и Ax2, Ay2. Точки, задающие расположение второго прямоугольника - Bx1,By1 и Bx2, By2.

# Схема расположения прямоугольников:

#             -------------* Bx2, By2
#             |  Ax2,Ay2   |
#    ---------------*      |
#    |        |h    |      |
#    |        |  w  |      |
#    | Bx1,By1*-----|-------
#    *--------------
# Ax1,Ay1

# Для вычисления площади нам необходимо найти величину 'w' - ширину области пересечения
#  и величину 'h' - высоту области пересечения двух прямоугольников.
# Для этого мы находим разность между минимумом из координат второй точки двух прямоугольников
# и максимумом из координат первой точки двух прямоугольников.
# Если прямоугольники пересекаются, обе величины 'w' и 'h' будут положительными.
# Если прямоугольники не пересекаются обе величины 'w' и 'h' или хотя бы одна из них
# будут отрицательными или равными нулю.

print('Введите через пробел координаты левой нижней точки первого прямоугольника:')
A_first = [int(s) for s in input().split()]

print('Введите через пробел координаты правой верхней точки первого прямоугольника:')
A_second = [int(s) for s in input().split()]

print('Введите через пробел координаты левой нижней точки второго прямоугольника:')
B_first = [int(s) for s in input().split()]

print('Введите через пробел координаты правой верхней точки второго прямоугольника:')
B_second = [int(s) for s in input().split()]


def intersection_area(A1, A2, B1, B2):
    """Функция возвращает площадь пересечения двух прямоугольников А и В,
    заданных координатами левой нижней и правой верхней точек.
    Если прямоугольники не пересекаются, возвращает 0."""
    # Находим ширину и высоту области пересечения:
    width = min(A2[0], B2[0]) - max(A1[0], B1[0])
    height = min(A2[1], B2[1]) - max(A1[1], B1[1])
    # Если обе величины положительные, находим их произведение:
    if width > 0 and height > 0:
        result = width * height
    else:  # В противном случае результат равен нулю.
        result = 0
    # Возвращаем результат:
    return result


print("Площадь пересечения:", intersection_area(A_first, A_second, B_first, B_second))
