# ЗАДАЧА "Ходы коня"
# https://informatics.mccme.ru/moodle/mod/statements/view3.php?id=6410&chapterid=111376
# На шахматной доске стоит конь. Отметьте положение коня на доске и все клетки, которые бьет конь.
# Клетку, где стоит конь, отметьте буквой “K”, клетки, которые бьет конь, отметьте символами “*”,
# остальные клетки заполните точками.
# Программа получает на вход координаты коня на шахматной доске в шахматной нотации (то есть в виде “e4”,
# где сначала записывается номер столбца (буква от “a” до “h”, слева направо),
# затем номер строки (цифра от 1 до 8, снизу вверх).
# Выведите на экран изображение доски.

# Вариант решения - в пределах доски 12 х 12 с выводом без боковых полей

pos = input("Введите позицию коня на доске в шахматной нотации: ")
row_ind = 10 - int(pos[1])
column_ind = 'abcdefgh'.find(pos[0]) + 2

A = [['.'] * 12 for g in range(12)]

A[row_ind][column_ind] = 'K'

for i in range(12):
    for j in range(12):
        A[row_ind - 2][column_ind - 1] = '*'
        A[row_ind - 1][column_ind - 2] = '*'
        A[row_ind - 2][column_ind + 1] = '*'
        A[row_ind - 1][column_ind + 2] = '*'
        A[row_ind + 2][column_ind - 1] = '*'
        A[row_ind + 1][column_ind - 2] = '*'
        A[row_ind + 2][column_ind + 1] = '*'
        A[row_ind + 1][column_ind + 2] = '*'

for i in range(2, 10):
    for j in range(2, 10):
        print(A[i][j], end=' ')
    print()
