# Написать функцию make_exchange(money, coins), которая принимает сумму денег (целое число)
# и массив номиналов разменных монет (целых чисел) (возможно пустой)
# и возвращает количество способов произвести размен.
# Считаем, что разменных монет бесконечное множество.
# Формат выходных данных: число способов произвести размен.
# Способы 1+2 и 2+1 считаем тождественными.
# Примеры
# Ввод
# 4
# 1 2
# Вывод
# 3
# Ввод
# 10
# 5 2 3
# Вывод
# 4


def make_exchange(amount: int, coins_list: list):
    """Функция возвращает кол-во способов размена суммы amount
    с помощью монет, имеющихся в отсортированном списке coins_list."""
    return exchange_count(amount, len(coins_list), coins_list)


def exchange_count(amount, kinds_of_coins, coins_list):
    """Функция возвращает кол-во способов размена суммы amount
    с помощью монет, имеющихся в отсортированном списке coins_list.
    Параметр kinds_of_coins ограничивает количество номиналов списка coins_list
    которые могут использоваться. Монеты в списке отсортированы по возрастанию номинала."""
    if amount == 0:  # Крайний случай: в процессе вычитания номиналов монет из суммы amount достигнут 0.
        return 1  # Размен возможен.
    if amount < 0 or kinds_of_coins == 0:  # Если закончились виды номиналов монет
        # или в процессе вычитания номиналов монет из суммы amount получено отрицательное число,
        return 0  # размен невозможен.
    else:  # Если номиналы еще имеются и сумма не уменьшилась до нуля,
        # убираем из списка монету самого большого номинала,
        # уменьшаем сумму amount на величину убранной монеты.
        return exchange_count(amount, kinds_of_coins - 1, coins_list) \
               + exchange_count(amount - denomination(kinds_of_coins, coins_list), kinds_of_coins, coins_list)


def denomination(kinds_of_coins: int, coins: list):
    """Функция возвращает номинал монеты по ее порядковому номеру в списке.
    kinds_of_coins - кол-во типов монет
    (всего и оставшихся после удаления наибольшего номинала).
    coins - полный список номиналов монет."""
    return coins[kinds_of_coins - 1]
    # Длине списка - 1 соответствует монета наибольшего номинала.


money = int(input())  # Сумма для размена
coins = [int(s) for s in input().split()]  # Номиналы монет в произвольном порядке

if coins == "[]":  # Если список номиналов пуст, нет способов размена. Завершаем программу.
    print(0)
    exit()

coins.sort()  # Если список не пуст, сортируем его по возрастанию номиналов монет.

coin_types = len(coins)  # Количество монет разного номинала в списке

x = make_exchange(money, coins)
print(x)
