# Простой неориентированный граф задан матрицей смежности.
# Найдите количество ребер в графе.
# На вход программы поступает число n ( 1 <= n <= 100) –
# количество вершин в графе, а затем n строк по n чисел,
# каждое из которых равно 0 или 1, – его матрица смежности.
# Выведите одно число – количество ребер заданного графа.

N = int(input())  # Количество вершин в графе

Graph = [0] * N  # Заготовка под матрицу смежности

total = 0  # Переменная для подсчета кол-ва связей в матрице

for i in range(N):  # Считываем строки в матрицу смежности
    row = [int(s) for s in input().split()]
    Graph[i] = row
    total += sum(row)

print(total//2)  # Для простого графа кол-во связей равно удвоенному кол-ву ребер.
