# Дан экзаменационный тест, содержащий n вопросов. Каждый вопрос имеет только один
# правильный вариант ответа из четырех. Определить вероятность того,
# что при случайном выборе ответов более 50% из них совпадут с правильными,
# для тестов в разным количеством вопросов.

import random


def random_answer(q, a):
    """Функция принимает число вопросов в тесте 'q'
    и количество возможных вариантов ответа 'a'.
    Генерирует случайные ответы на вопросы теста и
    для каждого вопроса возвращает булевское значение
    совпадения или несовпадения с правильным ответом."""
    for i in range(q):
        random_choice = random.randint(1, a)
        yield random_choice == test_answers[i]


sample = 10000  # Количество экспериментов для каждого случая

for i in range(5, 16):  # В диапазоне от 5 до 15 вопросов в тесте

    n = i  # Количество вопросов в тесте.

    success = 0  # Счетчик успешно пройденных тестов (>50% правильных ответов).
    # Обнуляется при каждом следующей цикле.

    for _ in range(sample):  # Повторяем эксперимент 10000 раз:

        # Генерируем случайный набор правильных ответов на n вопросов теста
        # (ответы могут быть пронумерованы от 1 до 4 включительно):
        test_answers = [random.randint(1, 4) for _ in range(n)]

        result = random_answer(n, 4)  # Сохраняем результат эксперимента в переменную result

        if sum(result) / n > 0.5:  # Вычисляем процент правильных ответов
            success += 1  # Если правильных ответов > 50%, увеличиваем счетчик.

    success_percentage = success / sample * 100  # Вычисляем среднее значение в выборке
    # для теста с заданным количеством вопросов.

    # Выводим результат:
    print('Number of questions = {0}.\tPassing answers = {1:.2f}%'.format(n, success_percentage))
