# Перевести число, записанное римскими цифрами, в число, записанное арабскими цифрами.
# Символы: I - 1, V - 5, X - 10, L - 50, C - 100, D - 500, M - 1000
# Натуральные числа записываются при помощи повторения этих цифр.
# При этом, если большая цифра стоит перед меньшей, то они складываются
# (принцип сложения), если же меньшая стоит перед большей,
# то меньшая вычитается из большей (принцип вычитания).
# Последнее правило применяется только во избежание четырёхкратного повторения одной и той же цифры.
# Формат входных данных
# Строка, представляющая число из римских цифр.
# Формат выходных данных
# Это же число в арабских цифрах.
# Примеры
# Ввод
# I
# Вывод
# 1
# Ввод
# IV
# Вывод
# 4

roman = input()  # Римское число

# Словарь преобразования базовых римских цифр в арабские:
conversion = {"I": 1, "V": 5, "X": 10, "L": 50, "C": 100, "D": 500, "M": 1000}

numbers = []  # Список будет содержать арабские цифры, соответствующие римским, составляющим заданное число.

limit = len(roman)  # Количество знаков в римском числе

for i in range(-1, -limit - 1, -1):
    numbers.append(conversion[roman[i]])  # Добавляем арабские цифры в список в обратной последовательности.

total = 0  # Счетчик итоговой суммы чисел
count = 0  # Счетчик текущей суммы чисел

prev_number = numbers[0]

for i in range(1, limit):
    number = numbers[i]
    if prev_number > number:
        prev_number = prev_number - number
    else:
        total += prev_number
        prev_number = number

total += prev_number

print(total)
