# Период строки. Дана непустая строка s. Нужно найти такое наибольшее число k,
# что s совпадает со строкой t, выписанной k раз подряд.
# Формат входных данных
# Одна строка длины N, 0 < N ≤ 10^6, состоящая только из маленьких латинских букв.
# Формат выходных данных
# Одно число - наибольшее возможное k.
# Примеры:
# aaaaa
# 5
# abcabcabc
# 3
# abab
# 2

string = input()

l = len(string)

for i in range(l, 0, -1):
    # Перебираем числа в диапазоне от длины строки до 1.
    # Если строка делится на текущее число без остатка,
    if l % i == 0:
        # Извлекаем срез строки, соответствующий этому числу
        # и получаем новую строку умножением фрагмента на i.
        from_substring = string[:l // i] * i

        flag = True

        for j in range(l):
            # Сравниваем исходную строку и строку, полученную умножением фрагмента.
            if string[j] != from_substring[j]:
                # Если встречаем несовпадение, прерываем цикл.
                flag = False
                break

        if flag == True:
            # Если строки идентичны, выводим i и завершаем программу.
            print(i)
            exit()
