# Боцман корабля «Тортуга» заразился неизвестным вирусом в последний день на суше перед долгим плаванием.
# Симптомы у носителя вируса появляются на 14-й день после дня заражения. На корабле «Тортуга»
# больной с симптомами сразу же отправляется на самоизоляцию в трюм и теряет возможность заражать других
# (в день проявления симптомов больной никого не заражает). Количество людей, которых заразит
# один носитель вируса в день при неограниченном кол-ве жертв, имеет биномиальное распределение
# с параметрами n=10 и p=0.08, и не зависит от кол-ва других носителей. На корабле 124 человека.
# На какой день плавания наиболее вероятно, что обнаружится, что все люди на корабле побывали в трюме?

# Формат вывода
# Укажите ответ в целочисленном формате.

# Количество зараженных и не зараженных к началу 1-го дня:
uninfected = 123
infected = 1

days = 0

p = 0.08

while uninfected > 0.5:
    days += 1
    new_infected = uninfected * p
    infected += new_infected
    uninfected -= new_infected

print(days + 14)

# День 81
