# Задача для собеседования

# Имеется числовая последовательность, на первом шаге состоящая из двух чисел 1.
# На каждом следующем шаге между каждыми двумя соседними элементами добавляется
# новый элемент, равный их сумме. После первых нескольких шагов
# последовательность выглядит следующим образом:
# 1 1
# 1 2 1
# 1 3 2 3 1
# 1 4 3 5 2 5 3 4 1

# Необходимо написать программу, которая по заданному числу n будет определять,
# сколько раз число n будет встречаться в последовательности на n-м шаге.

from collections import Counter

n = int(input())

sequence = [1, 1]

for i in range(n - 1):
    new_seq = (sequence * 2)[:-1]  # Длина новой последовательности 2х - 1 от исходной
    new_seq[::2] = sequence[:]  # Копируем значения исходной последовательности с шагом 2
    # Суммируем пары соседних чисел исходной последовательности:
    seq_1 = sequence[:-1]
    seq_2 = sequence[1:]
    sum_seq = []
    for j in range(len(seq_1)):
        sum_seq.append(seq_1[j] + seq_2[j])
    # Копируем полученные значения в новую последовательность с шагом 2, начиная со второго элемента
    new_seq[1::2] = sum_seq[:]
    # Обновляем исходную последовательность:
    sequence = new_seq

num_freqs = Counter(sequence)
print(num_freqs[n])
